{"meta":{"title":"News","subtitle":null,"description":null,"author":"Hoang Nghiem","url":"http://ai-news.xyz"},"pages":[{"title":"About","date":"2017-06-23T05:06:42.000Z","updated":"2017-06-23T04:58:55.000Z","comments":true,"path":"about/index.html","permalink":"http://ai-news.xyz/about/index.html","excerpt":"","text":""},{"title":"Tags","date":"2017-06-23T05:06:42.000Z","updated":"2017-06-23T04:58:55.000Z","comments":true,"path":"tags/index.html","permalink":"http://ai-news.xyz/tags/index.html","excerpt":"","text":""},{"title":"Categories","date":"2017-06-23T05:06:42.000Z","updated":"2017-06-23T04:58:55.000Z","comments":true,"path":"categories/index.html","permalink":"http://ai-news.xyz/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"Cơ bản về Tensorflow","slug":"intro-tensorflow","date":"2017-07-03T04:50:50.000Z","updated":"2017-07-03T05:03:30.000Z","comments":true,"path":"2017/07/03/intro-tensorflow/","link":"","permalink":"http://ai-news.xyz/2017/07/03/intro-tensorflow/","excerpt":"Nếu bạn đang tìm hiểu và có hứng thú với Machine Learning hay Deep Learning, bạn đang tìm một công cụ chuyên nghiệp để cài đặt những thuật toán một cách đơn giản hơn, tất cả những thứ bạn cần chính là Tensorflow. Bài này sẽ giới thiệu cơ bản về Tensorflow, cài đặt môi trường, cũng như cách sử dung.","text":"Nếu bạn đang tìm hiểu và có hứng thú với Machine Learning hay Deep Learning, bạn đang tìm một công cụ chuyên nghiệp để cài đặt những thuật toán một cách đơn giản hơn, tất cả những thứ bạn cần chính là Tensorflow. Bài này sẽ giới thiệu cơ bản về Tensorflow, cài đặt môi trường, cũng như cách sử dung. Tensorflow là gì?TensorFlow là 1 thư viện do Google phát triển và opensource vào tháng 11/2015, được sử dụng rất nhiều trong các service của Google. TensorFlow nguyên thủy được phát triển bởi đội Google Brain cho mục đích nghiên cứu và sản xuất của Google và sau đó được phát hành theo giấy phép mã nguồn mở Apache 2.0, tức là có thể sử dụng trong các sản phẩm thương mại khác. Cài đặt TensorflowTensorFlow hỗ trợ các hệ điều hành như Window, Linux, MacOS chỉ yêu cầu máy của bạn phải có Python 2.7 hoặc Python 3+ Các bạn có thể tham khảo cách cài đặt Python tại đây: https://basic.pythonvietnam.info/cai_dat_python.html Cài đặt pip3 (đây là 1 package dùng để quản lý các thư viên của python) tham khảo tại đây: https://pip.pypa.io/en/stable/installing/ Cài đặt TensorFlow 123pip install tensorflowpip install tensorflow-gpu (hỗ trợ gpu) Các bạn có thể tham khảo cách cài đặt ngay trên trang chủ của tensorflow https://www.tensorflow.org/install/ Đến đây là các bạn đã có thể bắt đầu lập trình với tensorflow rồi ~^_^~ Công cụ hỗ trợVì tensorflow là thư viện cho Python nên các bạn có thể sử dụng các IDE hỗ trợ Python như PyCharm để viết code, cũng có thể sử dụng SublimeText, Vim,.. những công cụ để viết code đơn giản. Ngoài ra, có một công cụ rất hay mà các bạn lập trình Python chắc không còn xa lạ gì đó là Jupyter (IPython Notebook) - đây là công cụ để code python ngay trên trình duyệt và có thể xem kết quả của từng câu lệnh được thực thi như thế nào. Đây là trang chủ http://jupyter.org/ , sau khi cài đặt được jupyter notebook thì các bạn cần cài thêm gói hỗ trợ tensorflow cho jupyter nữa thì mới có thể dùng được, để đơn giản hơn các bạn có thể sử dụng docker đã có sẵn tại link https://github.com/jupyter/docker-stacks/tree/master/tensorflow-notebook Chạy thử chương trình đơn giản với TensorChúng ta sẽ làm quen với tensor qua một ví dụ vô cùng đơn giản, đó là thực hiện phép nhân 2 số với nhau và in ra kết quả nhé. 123456789import tensorflow as tfx = tf.Variable([1.0, 2.0])y = tf.Variable([1.0, 2.0])z = x * ysess = tf.Session()init = tf.global_variables_initializer()sess.run(init)print(&quot;x = &quot;, sess.run(x))print(&quot;z = x * x = &quot;, sess.run(z)) Nhìn qua đoạn code trên thì cũng thấy khá phức tạp cho 1 yêu cầu đơn giản là nhân 2 số nhỉ. Chúng ta sẽ tìm hiểu kỹ hơn về cú pháp và cách sử dụng tensorflow trong các bài sau, khi đó các bạn sẽ thấy dễ hiểu hơn.","categories":[],"tags":[{"name":"tensorflow","slug":"tensorflow","permalink":"http://ai-news.xyz/tags/tensorflow/"}]}]}